cf_billing/Reports/энргНачислениеИПоступлениеПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>энргНачислениеИПоступлениеПоМесяцам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Enums/энргСпособНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСпособНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеПоСреднему</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднееПоНормативу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОДН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПриборам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНормативу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФормуламРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходПоАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БездоговорноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйОбъем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезучетноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочасовоеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МощностьНаРозничномРынке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МощностьНаПередачу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПотерь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоГрафикуГП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтАктивнойЭнергии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорныеОбъемы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостоянныйРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Reports/энргНачислениеИПоступлениеПоМесяцам/Forms/ФормаОтчетаУпр/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура Период(Команда)
	ОписаниеОповещенияВыборПериода = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    
    Диалог.Период.ДатаНачала    = Отчет.НачПериода;
    Диалог.Период.ДатаОкончания = Отчет.КонПериода;
	
	Отчет.НачПериода	= Диалог.Период.ДатаНачала;
	Отчет.КонПериода	= Диалог.Период.ДатаОкончания;
	Диалог.Показать(ОписаниеОповещенияВыборПериода);

КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(ИнтервалУстановлен, ДополнительныеПараметры) Экспорт	
	Если ИнтервалУстановлен = Неопределено тогда
		Возврат;
	КонецЕсли;	
	Отчет.НачПериода = ИнтервалУстановлен.ДатаНачала;
	Отчет.КонПериода = ИнтервалУстановлен.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)	
	
	СФормироватьОтчет();
	
КонецПроцедуры

&НаСервере
Функция СФормироватьОтчет()
	
	ТабДок.Очистить();
	
	Макет =  РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	ОбластьШапка 	= макет.ПолучитьОбласть("Шапка");
	ОбластьСальдо 	= Макет.ПолучитьОбласть("ДанныеПоСальдо");
	ОбластьДанныеПоНачислениям = МАкет.ПолучитьОбласть("ДанныеПоНачислениям");
	
	ОбластьШапка.Параметры.Период = ПредставлениеПериода(Отчет.НачПериода, Отчет.КонПериода);
	ТабДок.Вывести(ОбластьШапка);
	
	СформироватьТаблицуОплатыИНачислений(ОбластьСальдо);
	СформироватьТаблицуНачислений(ОбластьДанныеПоНачислениям);
	
	Возврат ТабДок
КонецФункции

&НаСервере
Процедура СформироватьТаблицуОплатыИНачислений(ОбластьСальдо)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(энргВзаиморасчетыОстаткиИОбороты.Период, МЕСЯЦ) КАК Месяц,
		|	СУММА(ЕСТЬNULL(энргВзаиморасчетыОстаткиИОбороты.СуммаРасход, 0)) КАК КредитНач,
		|	СУММА(ЕСТЬNULL(энргВзаиморасчетыОстаткиИОбороты.СуммаПриход, 0)) КАК ДебитНач
		|ПОМЕСТИТЬ ВТ_ДебитКредитНаНачало
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты.ОстаткиИОбороты(&НачПериода, , Месяц, , Абонент В ИЕРАРХИИ (&Абонент)) КАК энргВзаиморасчетыОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(энргВзаиморасчетыОстаткиИОбороты.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(энргВзаиморасчетыОстаткиИОбороты.Период, МЕСЯЦ) КАК Месяц,
		|	СУММА(ЕСТЬNULL(энргВзаиморасчетыОстаткиИОбороты.СуммаПриход, 0)) КАК ДебитКон,
		|	СУММА(ЕСТЬNULL(энргВзаиморасчетыОстаткиИОбороты.СуммаРасход, 0)) КАК КредитКон
		|ПОМЕСТИТЬ ВТ_ДебитКредитНаКонец
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты.ОстаткиИОбороты(, &КонПериода, Месяц, , Абонент В ИЕРАРХИИ (&Абонент)) КАК энргВзаиморасчетыОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(энргВзаиморасчетыОстаткиИОбороты.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(энргВзаиморасчеты.Период, МЕСЯЦ) КАК Месяц,
		|	СУММА(ЕСТЬNULL(энргВзаиморасчеты.Сумма, 0)) КАК Оплачено
		|ПОМЕСТИТЬ ВТ_Оплата
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
		|ГДЕ
		|	энргВзаиморасчеты.ВидДвижения = &Оплата
		|	И энргВзаиморасчеты.Период МЕЖДУ &НачПериода И &КонПериода
		|	И энргВзаиморасчеты.Абонент В ИЕРАРХИИ(&Абонент)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(энргВзаиморасчеты.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(энргВзаиморасчеты.Период, МЕСЯЦ) КАК Месяц,
		|	СУММА(ЕСТЬNULL(энргВзаиморасчеты.Сумма, 0)) КАК Начислено
		|ПОМЕСТИТЬ ВТ_Начисление
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
		|ГДЕ
		|	энргВзаиморасчеты.Период МЕЖДУ &НачПериода И &КонПериода
		|	И энргВзаиморасчеты.ВидДвижения = &Начисление
		|	И энргВзаиморасчеты.Абонент В ИЕРАРХИИ(&Абонент)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(энргВзаиморасчеты.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДебитКредитНаКонец.Месяц КАК Месяц,
		|	ЕСТЬNULL(ВТ_ДебитКредитНаНачало.ДебитНач, 0) КАК ДебитНач,
		|	ЕСТЬNULL(ВТ_ДебитКредитНаНачало.КредитНач, 0) КАК КредитНач,
		|	ЕСТЬNULL(ВТ_Начисление.Начислено, 0) КАК Начислено,
		|	ЕСТЬNULL(ВТ_Оплата.Оплачено, 0) КАК Оплачено,
		|	ЕСТЬNULL(ВТ_ДебитКредитНаКонец.ДебитКон, 0) КАК ДебитКон,
		|	ЕСТЬNULL(ВТ_ДебитКредитНаКонец.КредитКон, 0) КАК КредитКон,
		|	ВЫБОР
		|		КОГДА ВТ_Начисление.Начислено ЕСТЬ NULL 
		|				ИЛИ ВТ_Начисление.Начислено = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВТ_Оплата.Оплачено, 0) / ВТ_Начисление.Начислено
		|	КОНЕЦ КАК Сбор
		|ИЗ
		|	ВТ_ДебитКредитНаКонец КАК ВТ_ДебитКредитНаКонец
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Начисление КАК ВТ_Начисление
		|		ПО ВТ_ДебитКредитНаКонец.Месяц = ВТ_Начисление.Месяц
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Оплата КАК ВТ_Оплата
		|		ПО ВТ_ДебитКредитНаКонец.Месяц = ВТ_Оплата.Месяц
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДебитКредитНаНачало КАК ВТ_ДебитКредитНаНачало
		|		ПО ВТ_ДебитКредитНаКонец.Месяц = ВТ_ДебитКредитНаНачало.Месяц";
	
	Запрос.УстановитьПараметр("КонПериода"	, Отчет.КонПериода);
	Запрос.УстановитьПараметр("Начисление"	, ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("НачПериода"	, Отчет.НачПериода);
	Запрос.УстановитьПараметр("Оплата"		, ВидДвиженияНакопления.Расход);
	
	Если не ЗначениеЗаполнено(Отчет.Абонент) Тогда
		Запрос.Текст = СтрЗаменить(ЗАпрос.Текст,"И энргВзаиморасчеты.Абонент В ИЕРАРХИИ(&Абонент)","");
		Запрос.Текст = СтрЗаменить(ЗАпрос.Текст,"Абонент В ИЕРАРХИИ (&Абонент)","")
		
	Иначе
		
		Запрос.УстановитьПараметр("Абонент"		, Отчет.Абонент);
		
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьСальдо.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьСальдо.Параметры.ПроцентСбора = Окр((ВыборкаДетальныеЗаписи.Сбор)*100,2,2); 
		ТабДок.Вывести(ОбластьСальдо);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуНачислений(ОбластьДанныеПоНачислениям)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргОбъемНачислений.Абонент) КАК Абонент,
		|	СУММА(энргОбъемНачислений.ОбъемУслуги) КАК ОбъемУслуги,
		|	энргОбъемНачислений.СпособНачисления
		|ИЗ
		|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|ГДЕ
		|	энргОбъемНачислений.СпособНачисления = &Норматив
		|	И энргОбъемНачислений.Период МЕЖДУ &НачПериода И &КонПериода
		|	И энргОбъемНачислений.Абонент В ИЕРАРХИИ(&Абонент)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргОбъемНачислений.СпособНачисления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргОбъемНачислений.Абонент),
		|	СУММА(энргОбъемНачислений.ОбъемУслуги),
		|	энргОбъемНачислений.СпособНачисления
		|ИЗ
		|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|ГДЕ
		|	энргОбъемНачислений.СпособНачисления = &ПУ
		|	И энргОбъемНачислений.Период МЕЖДУ &НачПериода И &КонПериода
		|	И энргОбъемНачислений.Абонент В ИЕРАРХИИ(&Абонент)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргОбъемНачислений.СпособНачисления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргОбъемНачислений.Абонент),
		|	СУММА(энргОбъемНачислений.ОбъемУслуги),
		|	энргОбъемНачислений.СпособНачисления
		|ИЗ
		|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|ГДЕ
		|	энргОбъемНачислений.СпособНачисления = &НачПоСреднему
		|	И энргОбъемНачислений.Период МЕЖДУ &НачПериода И &КонПериода
		|	И энргОбъемНачислений.Абонент В ИЕРАРХИИ(&Абонент)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргОбъемНачислений.СпособНачисления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргОбъемНачислений.Абонент),
		|	СУММА(энргОбъемНачислений.ОбъемУслуги),
		|	энргОбъемНачислений.СпособНачисления
		|ИЗ
		|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|ГДЕ
		|	энргОбъемНачислений.СпособНачисления = &СредПоНормативу
		|	И энргОбъемНачислений.Период МЕЖДУ &НачПериода И &КонПериода
		|	И энргОбъемНачислений.Абонент В ИЕРАРХИИ(&Абонент)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргОбъемНачислений.СпособНачисления";
	
	Запрос.УстановитьПараметр("КонПериода"		, Отчет.КонПериода);
	Запрос.УстановитьПараметр("НачПериода"		, Отчет.НачПериода);
	Запрос.УстановитьПараметр("Норматив"		, Перечисления.энргСпособНачислений.ПоНормативу);
	Запрос.УстановитьПараметр("ПУ"				, Перечисления.энргСпособНачислений.ПоПриборам);
	Запрос.УстановитьПараметр("НачПоСреднему"	, Перечисления.энргСпособНачислений.НачислениеПоСреднему);
	Запрос.УстановитьПараметр("СредПоНормативу"	, Перечисления.энргСпособНачислений.СреднееПоНормативу);
	
	
	
	Если не ЗначениеЗаполнено(Отчет.Абонент) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргОбъемНачислений.Абонент В ИЕРАРХИИ(&Абонент)","");
		
	Иначе
		
		Запрос.УстановитьПараметр("Абонент"		, Отчет.Абонент);
		
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СпособНачисления = Перечисления.энргСпособНачислений.ПоНормативу  Тогда
			ОбластьДанныеПоНачислениям.Параметры.КолвоНорм 			= ВыборкаДетальныеЗаписи.Абонент;
			ОбластьДанныеПоНачислениям.Параметры.НачисленоНорм 		= ВыборкаДетальныеЗаписи.ОбъемУслуги;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
			ОбластьДанныеПоНачислениям.Параметры.КолвоПУ 			= ВыборкаДетальныеЗаписи.Абонент;
			ОбластьДанныеПоНачислениям.Параметры.НачисленоПУ 		= ВыборкаДетальныеЗаписи.ОбъемУслуги;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
			ОбластьДанныеПоНачислениям.Параметры.КолвоНачСред 		= ВыборкаДетальныеЗаписи.Абонент;
			ОбластьДанныеПоНачислениям.Параметры.НачисленоНачСред 	= ВыборкаДетальныеЗаписи.ОбъемУслуги;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СпособНачисления = Перечисления.энргСпособНачислений.СреднееПоНормативу Тогда
			ОбластьДанныеПоНачислениям.Параметры.КолвоСреднее 		= ВыборкаДетальныеЗаписи.Абонент;
			ОбластьДанныеПоНачислениям.Параметры.НачисленоСреднее 	= ВыборкаДетальныеЗаписи.ОбъемУслуги;
		КонецЕсли;
		
		// ТабДок.Вывести(ОбластьДанныеПоНачислениям);
	КонецЦикла;
	ТабДок.Вывести(ОбластьДанныеПоНачислениям);
КонецПроцедуры




#КонецОбласти
